{
	"articles": [
	    {
	    	"img-link": "http://tooskaweb.com/img/banner5.jpg",
	    	"title" : "Использование websocket в приложениях Extjs",
	    	"description": "Websocket, наверное, самое серьезное и полезное расширение протокола HTTP с момента его появления в начале девяностых. Использование websockets для обмена данными с сервером намного более выгодно, чем привычный AJAX. Экономия трафика в стандартных приложениях существенна, особенно, при активном обмене клиента и сервера небольшими сообщениями. Также, существенно сокращается время отклика при запросах данных. Основным препятствием на пути широкого распространения этой технологии долгое время было то, что многие прокси-сервера криво поддерживали расширенную версию http-протокола. Что приводило, в худшем случае, к проблемам безопасности (пруф). За последние пару лет ситуация с поддержкой вебсокетов стала выправляться и сейчас, на мой взгляд, настало их время. В этой статье описаны рецепты использования вебсокетов в стандартных компонентах Extjs (gridpanel, treepanel, combobox). И, также, в качестве замены Ext.Ajax.",
	    	"full": "Full text goes here",
	    	"tags": [
	        	{
	        		"tag-name": "HTML & CSS"
	        	},
	        	{
	        		"tag-name": "JavaScript"
	        	}
	    	],
	    	"article-link": "view.html#2",
	    	"id": 2
	    },
	    {
	    	"img-link": "http://codeforweb.tk/images/2.jpg",
	    	"title" : "Преимущевства использования Jquery",
	    	"description": "С каждым годом возможности веб-страниц все более возрастают, приближаясь по функциональности к прикладным программам, устанавливаемым в операционную систему. При помощи языка JavaScript веб-страницы становятся более живыми, удобными и отзывчивыми к пользователю. Но прописывать все эти эффекты вручную на JavaScript – это все равно, что изобретать заново велосипед. В настоящее время существует множество библиотек, которые позволяют одной строкой кода реализовать такие возможности, на описание которых JavaScript понадобились бы десятки строк. Самой распространенной и удобной среди них является библиотека JQuery.",
	    	"full": "Full text goes here",
	    	"tags": [
	        	{
	        		"tag-name": "JavaScript"
	        	},
	        	{
	        		"tag-name": "JQuery"
	        	}
	    	],
	    	"article-link": "view.html#1",
	    	"id": 1
	    }
	]
}